# ElectricalAnalyticalLoadCombinationUIService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ElectricalAnalyticalLoadCombinationUIService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The UI service which permits registration of an external server for UI managing Electrical Analytical Load Combination.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ElectricalAnalyticalLoadCombinationUIService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElectricalAnalyticalLoadCombinationUIService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ElectricalAnalyticalLoadCombinationUIService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace